src/Catalogs/Кластеры/Кластеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Кластеры</name>
  <attributes>
    <name>АдресRAS</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидХраненияАккаунта</name>
    <type>
      <types>EnumRef.ВидыХраненияАккаунтов</types>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аккаунт</name>
    <type>
      <types>CatalogRef.Аккаунты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПортRAS</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ВидыХраненияАккаунтов/ВидыХраненияАккаунтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыХраненияАккаунтов</name>
  <enumValues>
    <name>ЛогинПароль</name>
  </enumValues>
  <enumValues>
    <name>ОбщийАккаунт</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Кластеры/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс
// Возвращает логин и пароль для подключения к Кластеру в зависимости от вида хранения аккаунта.
//
// Возвращаемое значение:
//   Структура:
//       * Логин - Строка - логин для подключения к ИБ
//       * Пароль - Строка - пароль для подключения к ИБ
//
Функция ПолучитьДанныеАутентификации() Экспорт
	ЛогинПароль = Новый Структура("Логин, Пароль", "", "");
	
	Если ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ОбщийАккаунт Тогда
		Если ЗначениеЗаполнено(Аккаунт) Тогда
			ЛогинПароль.Логин = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Аккаунт, "Логин");
			ЛогинПароль.Пароль = ОбщегоНазначенияСтраж.ПолучитьПароль(Аккаунт);
		КонецЕсли;
	ИначеЕсли ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ЛогинПароль Тогда
		ЛогинПароль.Логин = Логин;
		ЛогинПароль.Пароль = ОбщегоНазначенияСтраж.ПолучитьПароль(Ссылка);
	КонецЕсли;
	Возврат ЛогинПароль;
КонецФункции
#КонецОбласти
#КонецЕсли
